Revit.Elements.UnknownElement
A Revit Element of an unknown type.  This allows an arbitrary element
to be passed around in the graph.

Revit.Elements.UnknownElement._element
A reference to the Revit Element

Revit.Elements.UnknownElement.#ctor(Autodesk.Revit.DB.Element)
Private constructor
element:

Revit.Elements.UnknownElement.InitUnknownElement(Autodesk.Revit.DB.Element)
Initialize an UnknownElement element
element:

Revit.Elements.UnknownElement.FromExisting(Autodesk.Revit.DB.Element,System.Boolean)
Wrap an element.  By default, this element is owned by Revit.  You must
set this value manually if that's not what you want.
element: